{"lesson": {"type": "sentence", "title": "The World’S Biggest Wave", "sentence": "A tsunami is a giant ocean wave. It is usually created by an earthquake on the seafloor and can travel hundreds or even thousands of miles across the ocean. The biggest local tsunami ever to hit land happened on July 9, 1958, when an earthquake shook the undersea fault near Lituya Bay, Alaska. Lituya Bay is part of Alaska’s Glacier Bay National Park. The magnitude 8.0 earthquake shook 40 million cubic yards of dirt, rocks, and ice from a mountain at the head of the bay. The landslide fell 3,000 feel and hit the water with tremendous force, which created the enormous tsunami wave. The wave was more than 1,640 feet (500 meters) high and crashed over five square miles of land, uprooting millions of trees. There were no towns in the area, so unlike the deadly tsunami of 2004, in which more than 200,000 people in Indonesia and elsewhere were killed, the 1958 tsunami killed two people. They were on a fishing boat anchored in the bay when the wave swamped them. Another boat, the Badger, was carrying William Swanson and his wife. The boat rode the wave inland before it began to sink. The Swansons were able to leap to a small skiff and were rescued a few hours later. A third boat, the Edrie, with Howard Ulrich and his seven-year-old son aboard, rode the wave over land and then back out to the bay. The Ulriches, amazingly, were unharmed. For many years, scientists debated about what really caused the tsunami in Lituya Bay. Some scientists claimed the amount of debris that fell into the bay was not enough to cause such a massive wave. They thought that the earthquake itself triggered the wave. However, as our understanding of geology, earthquakes, and tsunamis improved, most scientists now accept the rockslide as the true cause for the wave. No one disputes, however, that the wave was the largest ever recorded and will likely remain so for years to come.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "Most tsunamis occur because .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Dirt and ice fall into the sea", "value": "Dirt and ice fall into the sea"}, {"text_en": "There is an earthquake on the seafloor", "value": "There is an earthquake on the seafloor"}, {"text_en": "There is a storm far out at sea", "value": "There is a storm far out at sea"}, {"text_en": "There is an earthquake on land", "value": "There is an earthquake on land"}]}, {"type": "scq", "sentence": "How high was the tsunami in lituya bay?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "More than 1,640 feet", "value": "More than 1,640 feet"}, {"text_en": "5 square miles", "value": "5 square miles"}, {"text_en": "40 million cubic yards", "value": "40 million cubic yards"}, {"text_en": "500 feet", "value": "500 feet"}]}, {"type": "scq", "sentence": "How were the 1958 and 2004 tsunamis different?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "More people died in the 1958 tsunami.", "value": "More people died in the 1958 tsunami."}, {"text_en": "The 2004 tsunami was a bigger wave.", "value": "The 2004 tsunami was a bigger wave."}, {"text_en": "Nobody died in the 2004 tsunami.", "value": "Nobody died in the 2004 tsunami."}, {"text_en": "The 2004 tsunami killed a lot of people.", "value": "The 2004 tsunami killed a lot of people."}]}, {"type": "scq", "sentence": "What happened to the ulriches?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Their boat was swamped.", "value": "Their boat was swamped."}, {"text_en": "They escaped in a skiff.", "value": "They escaped in a skiff."}, {"text_en": "They rode the wave.", "value": "They rode the wave."}, {"text_en": "They were killed by the wave.", "value": "They were killed by the wave."}]}]}