{"lesson": {"type": "sentence", "title": "Taking Action", "sentence": "At Seven Oaks Middle School, Daniela Carrera was searching for a club to join. There was a dance club, a choir, an exercise club, and an action club that found creative ways to raise money for other people. Daniela was thinking about joining the dance club because she loved dancing. Then Daniela’s friend Ciara told her about the action club’s new project. At first, Daniela was skeptical. “Why would people in a nursing home want a video-game console?” she asked Ciara. “This would be a specific kind of console that plays fitness games. The games help people who need to exercise and move around but who can’t get to a gym or exercise safely outdoors. Besides, everybody loves video games, don’t they?” Ciara replied. “Not my great-grandmother,” Daniela said, laughing. But she agreed to go to the club meeting the next day. At the meeting, Mr. Washington, the club’s advisor, explained to Daniela and the others how fitness video games help motivate people to move. He described how the consoles can even help distract people who suffer from severe pain. That was all Daniela needed to hear. “How can I help?” she asked as she signed up for the club. “We’re selling raffle tickets. With the money we raise, we’ll buy two fitness consoles. We’ll give one to the winner of the raffle. We’ll give the other console to the nursing home,” explained Mr. Washington. “Great! Let’s get started. I’m motivated to sell some tickets today!” said Daniela.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "What is one theme of taking action?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "It is important to help your family.", "value": "It is important to help your family."}, {"text_en": "Helping others is important.", "value": "Helping others is important."}, {"text_en": "Exercising is more important than having fun.", "value": "Exercising is more important than having fun."}, {"text_en": "When we fail, we must try again.", "value": "When we fail, we must try again."}]}, {"type": "scq", "sentence": "How is the action club different from the other clubs daniela could join?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "You need to be invited to join the action club.", "value": "You need to be invited to join the action club."}, {"text_en": "You need to try out for the other clubs.", "value": "You need to try out for the other clubs."}, {"text_en": "In the action club, you raise money for causes.", "value": "In the action club, you raise money for causes."}, {"text_en": "In the other clubs, you make more friends.", "value": "In the other clubs, you make more friends."}]}, {"type": "scq", "sentence": "What is the authors main purpose for writing taking action?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "To inform readers about nursing homes", "value": "To inform readers about nursing homes"}, {"text_en": "To describe clubs at a school", "value": "To describe clubs at a school"}, {"text_en": "To persuade readers to buy video games", "value": "To persuade readers to buy video games"}, {"text_en": "To tell readers a story about a club project", "value": "To tell readers a story about a club project"}]}, {"type": "scq", "sentence": "Which of the following is not a theme of the passage?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Doing good deeds will win you friends.", "value": "Doing good deeds will win you friends."}, {"text_en": "Working together, you can help others.", "value": "Working together, you can help others."}, {"text_en": "Young people can make a difference.", "value": "Young people can make a difference."}, {"text_en": "Friends can inspire each other to do good things.", "value": "Friends can inspire each other to do good things."}]}]}