{"lesson": {"type": "sentence", "title": "Digging Into Custer’S Last Stand", "sentence": "For over a century, people have imagined the Battle of the Little Bighorn on June 25, 1876, as the brave “last stand” of General George Custer and his 7th Cavalry soldiers. Greatly outnumbered by Sioux and Cheyenne warriors, Custer and all 210 of his men died. The belief in Custer’s bravery started because of how the battlefield looked when it was discovered. A cluster of bodies, including the body of Custer, were found along with dead horses on a hill. People wanted to believe that the soldiers put up a good fight. Some Native American accounts also described the soldiers’ bravery. Over time, a story developed of the soldiers on the hill fighting heroically to the end. Then, in 1983, a prairie fire swept through the battlefield in Montana. The blaze burned off grass and shrubs, making it easier to dig for bullets and gun cartridges from the battle. Archaeologists examined old evidence in a new way. They used modern methods of investigation to better figure out what really happened. These new methods gave new clues about what happened to Custer and his men. Using the bullets they found, experts were able to trace the shots fired by both sides. This allowed them to reconstruct the movements of different groups on the battlefield. Based on the numbers of certain bullets and where they were found, a different account of the battle emerged. Instead of a long, brave battle, Custer’s men may have panicked, become disorganized, and lost the battle in a short amount of time.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "Information in the passage .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Disproves the new theory of custers last stand", "value": "Disproves the new theory of custers last stand"}, {"text_en": "Raises doubts about the old theory of custers last stand", "value": "Raises doubts about the old theory of custers last stand"}, {"text_en": "Questions whether custer won the battle", "value": "Questions whether custer won the battle"}, {"text_en": "Proves what happened to the horses", "value": "Proves what happened to the horses"}]}, {"type": "scq", "sentence": "What first caused experts to reexamine what happened at little bighorn?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "New native american accounts of the battle", "value": "New native american accounts of the battle"}, {"text_en": "The discovery of the original battlefield", "value": "The discovery of the original battlefield"}, {"text_en": "New technology for studying bullets", "value": "New technology for studying bullets"}, {"text_en": "A prairie fire on the battlefield", "value": "A prairie fire on the battlefield"}]}, {"type": "scq", "sentence": "According to the passage, the newer theory about custers last stand started .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Just after the battle in 1876", "value": "Just after the battle in 1876"}, {"text_en": "In the 1980s", "value": "In the 1980s"}, {"text_en": "With the discovery of the soldiers bodies", "value": "With the discovery of the soldiers bodies"}, {"text_en": "With the belief that soldiers are always heroic", "value": "With the belief that soldiers are always heroic"}]}, {"type": "scq", "sentence": "How does the author say investigators support the idea that there is a different theory for what happened at the battle of the little bighorn?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Investigators described eyewitness accounts.", "value": "Investigators described eyewitness accounts."}, {"text_en": "Investigators explained the methods of their investigation.", "value": "Investigators explained the methods of their investigation."}, {"text_en": "The investigators proved why the soldiers died quickly.", "value": "The investigators proved why the soldiers died quickly."}, {"text_en": "The investigators reconstructed movements on the battlefield.", "value": "The investigators reconstructed movements on the battlefield."}]}]}