{"lesson": {"type": "sentence", "title": "Ancient Greek Pe", "sentence": "If your favorite class is physical education, you would have been happy in ancient Greece, especially if you were a boy. The ancient Greeks believed that physical fitness was important and that a strong body was necessary for a strong mind. Teachers taught boys gymnastics and other sports. Boys also learned to swim, wrestle, and throw a discus and spear. From the time they were seven years old, boys went to school at a gymnasium, where all of their education took place. On the other hand, young girls were educated at home, mostly by their mothers. All girls learned domestic skills, and wealthy girls learned to read and write. While they did learn to dance, physical education was not thought to be as important for girls. In the gymnasiums, live music accompanied physical training. Ancient Greeks believed that music was important for the soul. As wealthy boys grew into young men, they trained to take part in important competitions like the Olympic Games. The best athletes competed for their regions. Although winners did not receive prize money, they did win fame. Greeks believed the winners were favored by their gods. The physical training that boys received also helped turn them into the strong and fit soldiers that they were expected to become.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "The authors purpose in writing this passage is mainly to .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Convince readers to improve physical education programs in this country", "value": "Convince readers to improve physical education programs in this country"}, {"text_en": "Inform readers about physical education in ancient greece", "value": "Inform readers about physical education in ancient greece"}, {"text_en": "Entertain readers with a story about the olympic games", "value": "Entertain readers with a story about the olympic games"}, {"text_en": "Persuade readers to exercise more", "value": "Persuade readers to exercise more"}]}, {"type": "scq", "sentence": "What is one difference in the way boys and girls were educated in ancient greece?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Girls were educated at home.", "value": "Girls were educated at home."}, {"text_en": "Girls were educated in a boarding school.", "value": "Girls were educated in a boarding school."}, {"text_en": "Boys were educated by their mothers.", "value": "Boys were educated by their mothers."}, {"text_en": "Boys were educated at home.", "value": "Boys were educated at home."}]}, {"type": "scq", "sentence": "Why does the author include information about girls education in ancient greece?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "To show what happened at gymnasiums", "value": "To show what happened at gymnasiums"}, {"text_en": "To illustrate the equal treatment that boys and girls received", "value": "To illustrate the equal treatment that boys and girls received"}, {"text_en": "To explain how girls became skilled musicians", "value": "To explain how girls became skilled musicians"}, {"text_en": "To contrast how boys and girls were educated", "value": "To contrast how boys and girls were educated"}]}, {"type": "scq", "sentence": "What physical fitness activity did girls learn?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Homemaking", "value": "Homemaking"}, {"text_en": "Dancing", "value": "Dancing"}, {"text_en": "Running", "value": "Running"}, {"text_en": "Jumping", "value": "Jumping"}]}]}