{"lesson": {"type": "sentence", "title": "The Smilodon And The Tiger", "sentence": "Although the now-extinct smilodon is also known as the saber-toothed tiger, it was not a close relative of the modern tiger. The more scientists study the two big cats, the more differences they find. Tigers travel by themselves and run fast while chasing their prey. The smilodon, on the other hand, probably lived in packs. With much shorter tails than today’s tigers, the smilodon did not have the balance to run at top speeds. It probably caught its prey by hiding quietly until an animal came near. Then, the smilodon would surprise its prey. Another main difference between today’s tiger and the smilodon is the size of the smilodon’s teeth. It is known as a “saber-toothed” cat because of two enormous teeth that grew from the top of its jaw. These teeth grew up to seven inches long and were surprisingly fragile. The smilodon probably used the teeth to bite into soft parts of its prey’s body, such as its stomach. A modern tiger’s teeth are much smaller, but they are stronger. The smilodon lived in North and South America from about two million years ago until about ten thousand years ago. Tigers, of course, still exist today and live in eastern and southeastern Asia. No one knows for sure why the smilodon became extinct. However, scientists do know that many of today’s tiger species are in danger of becoming extinct because of loss of habitat and human activity.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "Although the smilodon and the tiger were not close relatives, what did they have in common?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Both lived in north and south america.", "value": "Both lived in north and south america."}, {"text_en": "Both had long tails and long legs.", "value": "Both had long tails and long legs."}, {"text_en": "Both hunted prey.", "value": "Both hunted prey."}, {"text_en": "Both became extinct because of hunting.", "value": "Both became extinct because of hunting."}]}, {"type": "scq", "sentence": "What is the authors purpose of the passage?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "To persuade readers to protect tigers", "value": "To persuade readers to protect tigers"}, {"text_en": "To entertain readers with a story about a make-believe animal", "value": "To entertain readers with a story about a make-believe animal"}, {"text_en": "To inform readers about tiger habitats", "value": "To inform readers about tiger habitats"}, {"text_en": "To describe two kinds of big cats", "value": "To describe two kinds of big cats"}]}, {"type": "scq", "sentence": "According to the passage, one difference between the smilodon and the tiger is .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "The size of their teeth", "value": "The size of their teeth"}, {"text_en": "The size of their ears", "value": "The size of their ears"}, {"text_en": "The kind of food eaten", "value": "The kind of food eaten"}, {"text_en": "The length of time they lived on earth", "value": "The length of time they lived on earth"}]}, {"type": "scq", "sentence": "One message of the passage is that .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "The largest animals are the best hunters", "value": "The largest animals are the best hunters"}, {"text_en": "Animals that look similar can actually be quite different", "value": "Animals that look similar can actually be quite different"}, {"text_en": "Modern tigers need to be more like smilodons if they are to survive", "value": "Modern tigers need to be more like smilodons if they are to survive"}, {"text_en": "The fate of animals of the past was controlled by humans", "value": "The fate of animals of the past was controlled by humans"}]}]}