{"lesson": {"type": "sentence", "title": "Ishmael And Isadore", "sentence": "Brothers Ishmael and Isadore were complete opposites. People who knew them both could hardly believe they were from the same planet, let alone the same family. The boys were not unkind toward one another, but their personalities were so different that it was difficult for them to reach a decision they both liked. Their mother frequently played the referee in their disagreements. Ishmael, the older brother, was tall and athletic, and he loved sports. He played baseball, football, and basketball. Isadore, the younger brother, hated sports. He was quieter and less active than his brother. He preferred spending his time on the computer, making short videos and writing blog entries. The brothers’ taste in music was completely different, too. Ishmael loved classic rock. He listened to bands like the Beatles, the Who, and the Rolling Stones. Isadore didn’t care much for those bands. He preferred spending his time streaming world music, especially music from Central Africa. Luckily for their parents, both boys enjoyed listening to music through headphones. One other thing the brothers did agree on was that they wanted a pet. Mom had resisted getting one, but after both brothers had pleaded and begged, she finally agreed. “We can get a pet, as long as you two take care of it,” she said. “That means you do the feeding, you do the training, and if it needs to be walked, you do the walking.” “No problem, Mom,” Ishmael and Isadore said together. “Good, we all agree,” Mom said. “Now, what kind of pet are we going to get?”", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "Which best describes what the passage is about?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Two brothers who argue with their mother", "value": "Two brothers who argue with their mother"}, {"text_en": "Two brothers who love sports", "value": "Two brothers who love sports"}, {"text_en": "Two brothers who are very much alike", "value": "Two brothers who are very much alike"}, {"text_en": "Two brothers who mostly disagree", "value": "Two brothers who mostly disagree"}]}, {"type": "scq", "sentence": "Which of these details supports the main idea of the passage?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "The brothers have different tastes in music.", "value": "The brothers have different tastes in music."}, {"text_en": "Mom says they must take care of the pet.", "value": "Mom says they must take care of the pet."}, {"text_en": "The brothers have a lot in common.", "value": "The brothers have a lot in common."}, {"text_en": "The brothers names are ishmael and isadore.", "value": "The brothers names are ishmael and isadore."}]}, {"type": "scq", "sentence": "Based on information about the brothers, which of these do you predict will happen next?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "They will have trouble deciding what kind of pet to get.", "value": "They will have trouble deciding what kind of pet to get."}, {"text_en": "They will both want a dog to play sports with.", "value": "They will both want a dog to play sports with."}, {"text_en": "They will both want to get a snake.", "value": "They will both want to get a snake."}, {"text_en": "They will agree on their pets name.", "value": "They will agree on their pets name."}]}, {"type": "scq", "sentence": "If the brothers get a dog, which of these is least likely to happen?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Ishmael will run with the dog.", "value": "Ishmael will run with the dog."}, {"text_en": "Isadore will make videos of the dog.", "value": "Isadore will make videos of the dog."}, {"text_en": "They will always agree on what to do with the dog.", "value": "They will always agree on what to do with the dog."}, {"text_en": "They will argue about who walks the dog.", "value": "They will argue about who walks the dog."}]}]}