{"lesson": {"type": "sentence", "title": "Ray Wallace’S Bigfoot Hoax", "sentence": "For decades, people have heard about sightings of a gigantic creature in the forests of the Pacific Northwest. According to the stories, the creature always left huge footprints. A logger named Ray Wallace helped popularize these stories about the creature known as Bigfoot. In 1958, one of Wallace’s workers told a newspaper about spotting the creature’s tracks. Wallace explained that his workers were scared of the beast. The story spread, and some people connected the creature to other legendary monsters, especially the Abominable Snowman, or Yeti, said to live in the mountains of Nepal. Wallace had pictures and film footage of a huge, furry primate to back up his story. He also tried to sell castings of giant footprints and recordings of the creature’s cries. But in 2002, after Ray Wallace died, his family members had their own story to tell. They said that Wallace was a prankster and made the giant footprints himself. Wallace’s wife admitted dressing up in a Bigfoot costume as part of the hoax. Apparently, Ray Wallace enjoyed fooling people. He told his Bigfoot stories for decades. However, Wallace certainly was not responsible for all the other reported sightings of Bigfoot. In fact, some people continue to report seeing the monster. Despite some people’s belief that Bigfoot exists, when Ray Wallace passed away, his own son said, “Bigfoot is dead.”", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "In the passage, the author mainly tries to .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Entertain readers with colorful tales about bigfoot", "value": "Entertain readers with colorful tales about bigfoot"}, {"text_en": "Inform readers about a famous prank", "value": "Inform readers about a famous prank"}, {"text_en": "Persuade readers that wallace was a criminal", "value": "Persuade readers that wallace was a criminal"}, {"text_en": "Instruct readers on how to create their own hoaxes", "value": "Instruct readers on how to create their own hoaxes"}]}, {"type": "scq", "sentence": "Why does the author include the quotation from wallaces son at the end of the passage?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "To show that many still believe in bigfoot", "value": "To show that many still believe in bigfoot"}, {"text_en": "To show how the son felt about his fathers death", "value": "To show how the son felt about his fathers death"}, {"text_en": "To show that the son does not believe in bigfoot", "value": "To show that the son does not believe in bigfoot"}, {"text_en": "To persuade readers that the monster exists", "value": "To persuade readers that the monster exists"}]}, {"type": "scq", "sentence": "Which detail might be true for a yeti, but not for bigfoot?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "It lives in nepal.", "value": "It lives in nepal."}, {"text_en": "It is large and furry.", "value": "It is large and furry."}, {"text_en": "Ray wallace invented stories about it.", "value": "Ray wallace invented stories about it."}, {"text_en": "People are frightened by it.", "value": "People are frightened by it."}]}, {"type": "scq", "sentence": "Which of these is one theme of ray wallaces bigfoot hoax?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Many things in nature cannot be explained.", "value": "Many things in nature cannot be explained."}, {"text_en": "Nature is filled with terrifying things.", "value": "Nature is filled with terrifying things."}, {"text_en": "Secrets are safe with families, even after members of a family die.", "value": "Secrets are safe with families, even after members of a family die."}, {"text_en": "One persons monster may be another persons prank.", "value": "One persons monster may be another persons prank."}]}]}