{"lesson": {"type": "sentence", "title": "Florida’S Python Problem", "sentence": "Sometimes pets are more than we can handle, like when a small puppy grows up to be a huge dog. People can usually find a new home for a big dog, but a giant pet snake is not so easy to give away. As a result, some people in Florida have released their pet pythons into the wilderness of the Florida Everglades. Problem solved? Only for the pet owners. The snakes that are the biggest problem are Burmese pythons. These snakes are not native to the Everglades. Pet dealers originally brought them to the United States from Southeast Asia. Because Burmese pythons are not native, they disrupt the natural order of the Everglades’ ecosystem. The snakes’ size and strength are also a problem. Burmese pythons can grow to be 20 feet long. There are reports of terrifying battles between pythons and alligators in the Everglades. Even more worrisome is the impact on creatures that are no match for the monster snakes. For example, biologists have discovered endangered birds, bobcats, and woodrats in pythons’ stomachs. Another effect of python dumping is the spread of these snakes beyond the Everglades. Pythons swim well and can move more than a mile a day on land. In addition, one snake can produce nearly 100 eggs. Their wide range of movement and high rate of birth means that the snakes can quickly overrun a habitat. As a result of this scary scenario, Florida park rangers, wildlife officials, and others are on “python patrol.” They capture and kill Burmese pythons to try to keep the numbers under control. There is also a greater effort to teach people about the responsibilities of keeping a python.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "Which of these has caused burmese pythons to be found in the florida everglades?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Pet owners who let them go", "value": "Pet owners who let them go"}, {"text_en": "Pet dealers who released them into the wild", "value": "Pet dealers who released them into the wild"}, {"text_en": "The large number of eggs the snakes produce", "value": "The large number of eggs the snakes produce"}, {"text_en": "The snakes ability to swim and move well", "value": "The snakes ability to swim and move well"}]}, {"type": "scq", "sentence": "One effect of pythons in the everglades is .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "They can grow to 20 feet long", "value": "They can grow to 20 feet long"}, {"text_en": "They put endangered animals at greater risk", "value": "They put endangered animals at greater risk"}, {"text_en": "Biologists can study them in their natural habitat", "value": "Biologists can study them in their natural habitat"}, {"text_en": "They control the alligator population", "value": "They control the alligator population"}]}, {"type": "scq", "sentence": "Which evidence best explains why pythons are spreading beyond the everglades?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Pythons are not native to the everglades.", "value": "Pythons are not native to the everglades."}, {"text_en": "Burmese pythons can grow to 20 feet long.", "value": "Burmese pythons can grow to 20 feet long."}, {"text_en": "Pythons can swim and move well on land.", "value": "Pythons can swim and move well on land."}, {"text_en": "Florida park rangers are on python patrol.", "value": "Florida park rangers are on python patrol."}]}, {"type": "scq", "sentence": "Which of these happened after pythons became a problem in florida?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Pythons grew too big to handle at home.", "value": "Pythons grew too big to handle at home."}, {"text_en": "Owners became educated about pythons.", "value": "Owners became educated about pythons."}, {"text_en": "People no longer got pythons as pets.", "value": "People no longer got pythons as pets."}, {"text_en": "Pet dealers stopped bringing pythons to the united states.", "value": "Pet dealers stopped bringing pythons to the united states."}]}]}