{"lesson": {"type": "sentence", "title": "Three Parts For Three Characters", "sentence": "Denzel could hear the sounds of the song “Follow the Yellow Brick Road” as he walked closer to the auditorium. He was relieved that the auditions weren’t over. He really wanted to try out for the sixth-grade production of The Wizard of Oz. Waiting in the hall were his two best friends, Colin and Felipe. Colin was walking on his hands in a wide circle. Then he did a back flip, a cartwheel, and a backward leap into a handstand. Felipe was doing his favorite herky-jerky robot dance. Just as Denzel reached the boys, there was a sudden boom outside. “What was that?” Denzel shouted. He had a voice that could be loud and strong one moment and drop to a whisper the next instant. “It’s thunder,” Colin laughed. “You should audition for the role of the character who needs courage!” “Come on!” Felipe urged with a stiff turn and bow to end his dance. “We’ll miss our turns!” The trio hurried inside the auditorium. A girl named Rachel, with hair teased like a lion’s mane, was beginning her audition. The boys watched her. She pranced around the stage like a lion, but she spoke very quietly, and it was hard to hear her. When she finished, Felipe auditioned by dancing like a robot. Colin went next, showing his acrobatic skills. Denzel went last. When the auditions ended, each boy had the perfect part for his talents. Colin was the Scarecrow, who is supposed to flop, slip, and slide all over the stage. Felipe’s robot moves were just like the Tin Man in his rusty metal suit. And Denzel’s booming roar and soft whisper made him the best Cowardly Lion the play could have.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "There is evidence in the passage to support the idea that denzel .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Has never acted in a play before", "value": "Has never acted in a play before"}, {"text_en": "Is always late", "value": "Is always late"}, {"text_en": "Is easily startled", "value": "Is easily startled"}, {"text_en": "Does not get along with colin", "value": "Does not get along with colin"}]}, {"type": "scq", "sentence": "In the passage, which of these happens first?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "The boys get the perfect parts.", "value": "The boys get the perfect parts."}, {"text_en": "Colin and felipe practice in the hallway.", "value": "Colin and felipe practice in the hallway."}, {"text_en": "Denzel hears a loud clap of thunder.", "value": "Denzel hears a loud clap of thunder."}, {"text_en": "A girl named rachel finishes her audition.", "value": "A girl named rachel finishes her audition."}]}, {"type": "scq", "sentence": "What is the most likely reason that denzel got the part of the cowardly lion?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "It was the only part available.", "value": "It was the only part available."}, {"text_en": "He was scared of the thunder.", "value": "He was scared of the thunder."}, {"text_en": "No one else auditioned for the part.", "value": "No one else auditioned for the part."}, {"text_en": "He had the right voice for the role.", "value": "He had the right voice for the role."}]}, {"type": "scq", "sentence": "Why did colin probably get the role of scarecrow?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "He is good at doing acrobatics.", "value": "He is good at doing acrobatics."}, {"text_en": "He is a very serious person.", "value": "He is a very serious person."}, {"text_en": "He used dance moves during the audition.", "value": "He used dance moves during the audition."}, {"text_en": "He had his hair teased for the part.", "value": "He had his hair teased for the part."}]}]}