{"lesson": {"type": "sentence", "title": "The Cliff Dwellers", "sentence": "Mesa Verde, which means “green table” in Spanish, is a high plateau in Colorado. Made of sandstone and shale, this plateau rises almost 2,000 feet above surrounding land. The mesa has many canyons with streams and rivers running through them. At the tops of the rocky canyon walls, there are many overhangs and cave-like alcoves that have formed from water seeping into the sandstone. People first came to Mesa Verde sometime around ad 550. These early inhabitants dug into the floors of the alcoves, creating what are now called pit houses. Around 750, people moved out of the pit houses in the canyon walls and built above-ground houses from mud and stone. Then, around the year 1200, they returned to the alcoves in the canyon walls. Nobody knows why the people returned to the cliff pit houses. They may have feared attack from other groups and believed the alcoves offered better protection. They may have wanted better shelter from the wind and blistering sun. Whatever the reason, the cliff dwellers stayed less than a hundred years in the pit houses after they had moved back. By 1300, the cliff dwellings had been abandoned, probably because of a severe drought in the area. It wasn’t until over four hundred years later that cowboys, trappers, and prospectors began to visit and photograph Mesa Verde, astonished by the sight of hundreds of cliff houses built into the walls of the canyons.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "According to the passage, which event happened last?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Mesa verde inhabitants created pit houses.", "value": "Mesa verde inhabitants created pit houses."}, {"text_en": "Water seeped into the rock and created alcoves.", "value": "Water seeped into the rock and created alcoves."}, {"text_en": "Cowboys, trappers, and prospectors learned of the cliff dwellings.", "value": "Cowboys, trappers, and prospectors learned of the cliff dwellings."}, {"text_en": "Cliff dwellers abandoned the canyon walls because of drought.", "value": "Cliff dwellers abandoned the canyon walls because of drought."}]}, {"type": "scq", "sentence": "What kind of homes did the mesa verde inhabitants first build?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Pit houses", "value": "Pit houses"}, {"text_en": "Cave houses", "value": "Cave houses"}, {"text_en": "Stone and mud houses", "value": "Stone and mud houses"}, {"text_en": "Wooden houses", "value": "Wooden houses"}]}, {"type": "scq", "sentence": "The mesa verde inhabitants returned to the alcoves in canyon walls .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Before ad 550", "value": "Before ad 550"}, {"text_en": "Around 750", "value": "Around 750"}, {"text_en": "Around 1200", "value": "Around 1200"}, {"text_en": "After 1300", "value": "After 1300"}]}, {"type": "scq", "sentence": "What were the last homes that the mesa verde people inhabited?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Cliff tops", "value": "Cliff tops"}, {"text_en": "Pit houses", "value": "Pit houses"}, {"text_en": "Stone and mud houses", "value": "Stone and mud houses"}, {"text_en": "Wooden houses", "value": "Wooden houses"}]}]}