{"lesson": {"type": "sentence", "title": "Up To The Mountaintop", "sentence": "I like challenges, but this one was almost too difficult. I had begged Mom to take me on a completely new adventure for my sixteenth birthday. Now, here we were, just Mom and me with our guide, Milo, standing on the shore of Lake Arenal in Costa Rica. Towering above the lake was Volcán Arenal, one of the active volcanoes in the region. I watched as the volcano spit out lava and coughed up big boulders. Luckily, we were headed in the other direction. Milo greeted us in Spanish and helped us mount our horses. Getting on my horse was difficult, but controlling it was a little easier. We started on our tour. The guidebook said we’d cross three rivers. As we splashed through a stream, I asked, “Was that the first river?” “I don’t think so, Katie,” Mom said wryly. Soon enough, we came to the first river. There was no mistaking it. I felt sick to my stomach when I saw that the far shore was half a football field away! The 4-foot-deep river flowed over boulders. So much for dry shoes—or jeans. After two more rivers, the trail got even steeper and muddier. With each step of the horses’ hooves, there were loud squishing and sucking sounds. The rainforest was magnificent and absolutely beautiful. But I wondered whether my horse could keep its balance in knee-high mud. What did I know about horses? I imagined my mare stumbling on rocks hidden beneath the sludge—and us crashing over a cliff and being swept away by lava. Three terrifying hours later, we came to a corral. Were we stopping, I wondered. To one side was a gorgeous view of the lake and volcano, and to the other, a brightly painted restaurant. “Okay,” I laughed nervously. “That was terrifying, but I’m so glad we did it!”", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "Which adjectives best describe katie?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Sensitive and shy", "value": "Sensitive and shy"}, {"text_en": "Calm and relaxed", "value": "Calm and relaxed"}, {"text_en": "Adventurous but nervous", "value": "Adventurous but nervous"}, {"text_en": "Interested but withdrawn", "value": "Interested but withdrawn"}]}, {"type": "scq", "sentence": "Which inference can you make about katies experience riding horses?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "She is an expert rider.", "value": "She is an expert rider."}, {"text_en": "She has probably trained others to ride.", "value": "She has probably trained others to ride."}, {"text_en": "She dislikes horses.", "value": "She dislikes horses."}, {"text_en": "She has little experience riding horses.", "value": "She has little experience riding horses."}]}, {"type": "scq", "sentence": "Which best describes the setting of the memoir?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Dangerous", "value": "Dangerous"}, {"text_en": "Boring", "value": "Boring"}, {"text_en": "Busy", "value": "Busy"}, {"text_en": "Crowded", "value": "Crowded"}]}, {"type": "scq", "sentence": "What is the theme of katies memoir?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "It is good to push yourself to try new things.", "value": "It is good to push yourself to try new things."}, {"text_en": "Most people fail when they try new things.", "value": "Most people fail when they try new things."}, {"text_en": "Fear stops people from trying new things.", "value": "Fear stops people from trying new things."}, {"text_en": "What is familiar is better than what is unknown.", "value": "What is familiar is better than what is unknown."}]}]}