{"lesson": {"type": "sentence", "title": "Hoodoos In Bryce Canyon", "sentence": "Imagine the spires at the top of a sand castle—the kind you create by dripping layers of very wet sand. Hoodoos, a type of rock formation found primarily in Bryce Canyon, Utah, look something like wet sand, but they are made from colorful rock. Every year, millions of people come to Bryce Canyon to look at the pole-shaped hoodoos, which range from 5 to 150 feet tall. What caused these amazing formations? Scientists believe that water is responsible. Over millions of years, water and ice have shaped the limestone of the area, creating canyons, deep bowls, plateaus, and hoodoos. On many days in this region, the temperatures are freezing at night and much warmer during the day. The sun melts snow, and the resulting water flows into cracks in the limestone. When the water freezes at night, it expands and causes the cracks to widen and pull the rock apart. This is called frost wedging. Another way that water shapes the hoodoos is simply through rainfall. The rain contains a small amount of acid, which causes the soft limestone to dissolve. Some layers of rock in the hoodoos are harder than other layers, making parts of the hoodoos wear away more slowly. This gives hoodoos their unusual shapes and appearances. Visitors to Bryce Canyon can hike through miles of natural mazes formed by hoodoos. However, to protect the fragile spires, visitors are asked to stay on the trails. If they were to climb on the hoodoos, they could damage the formations and rob future generations of the chance to see something that took eons to form.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "Why does the author discuss sand castle spires at the beginning of the passage?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "To help readers visualize hoodoos", "value": "To help readers visualize hoodoos"}, {"text_en": "To remind readers of their childhood", "value": "To remind readers of their childhood"}, {"text_en": "To show that hoodoos are made of sand", "value": "To show that hoodoos are made of sand"}, {"text_en": "To explain how people create hoodoos", "value": "To explain how people create hoodoos"}]}, {"type": "scq", "sentence": "Which phrase provides the best evidence that hoodoos have an amazing appearance?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Some layers of rock in the hoodoos are harder.", "value": "Some layers of rock in the hoodoos are harder."}, {"text_en": "Over millions of years, water and ice have shaped the limestone.", "value": "Over millions of years, water and ice have shaped the limestone."}, {"text_en": "When the water freezes at night, it expands.", "value": "When the water freezes at night, it expands."}, {"text_en": "Every year, millions of people come to bryce canyon to look at the hoodoos.", "value": "Every year, millions of people come to bryce canyon to look at the hoodoos."}]}, {"type": "scq", "sentence": "Which statement is not made in the passage?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Frost wedging shapes limestone.", "value": "Frost wedging shapes limestone."}, {"text_en": "Wind shapes limestone.", "value": "Wind shapes limestone."}, {"text_en": "Water shapes limestone.", "value": "Water shapes limestone."}, {"text_en": "People can harm hoodoos.", "value": "People can harm hoodoos."}]}, {"type": "scq", "sentence": "Which phrase best supports the idea that humans can affect the rock formations?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Every year, millions of people come to bryce canyon.", "value": "Every year, millions of people come to bryce canyon."}, {"text_en": "Visitors can hike through miles of natural mazes formed by hoodoos.", "value": "Visitors can hike through miles of natural mazes formed by hoodoos."}, {"text_en": "If they were to climb on the hoodoos, they could damage the formations.", "value": "If they were to climb on the hoodoos, they could damage the formations."}, {"text_en": "Scientists believe that water is responsible.", "value": "Scientists believe that water is responsible."}]}]}