{"lesson": {"type": "sentence", "title": "A Little Can Go A Long Way", "sentence": "In a village in Uganda, a woman named Fatima Serwona ran a small store. She sold food and other useful items. However, she had trouble making enough money to keep the shelves stocked. To stay in business, Fatima got a microfinance loan—a small sum of money from a person in another country. It was just enough for her to buy a cell phone. She let villagers make calls using her phone and charged them a small fee for each call. This helped her make enough money to keep her shelves stocked with items. Fatima then used the money to send her children to school and improve their lives, as well as her own. Microfinance is the practice of giving small loans to people in need. Most microfinance loans are for less than two hundred dollars. The loans are used to start or expand a small business, such as catching fish, raising chickens, weaving, or selling produce. Lenders are willing to make these loans because most of the people who receive them are very likely to repay the loans. Microfinance loans are important for several reasons. The businesses that these loans support often provide needed services or goods to their communities. Also, many of the people who receive microfinance loans cannot get money any other way. And although they have to pay a high rate of interest on the money they borrow, the rate is lower than if they borrowed from a local moneylender. It doesn’t seem like such a small amount of money could make a big difference, but microfinance loans have been shown to help improve individual lives and revitalize whole communities like Fatima’s.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "Why did fatima serwona buy a cell phone?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "To make calls to order goods", "value": "To make calls to order goods"}, {"text_en": "To make additional money for her business", "value": "To make additional money for her business"}, {"text_en": "To link her village with other villages", "value": "To link her village with other villages"}, {"text_en": "To call villagers to tell them about her store", "value": "To call villagers to tell them about her store"}]}, {"type": "scq", "sentence": "Why do you think so many microfinance borrowers are likely to repay their loans?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "The borrowers are both successful and grateful.", "value": "The borrowers are both successful and grateful."}, {"text_en": "The lenders threaten them if they do not repay.", "value": "The lenders threaten them if they do not repay."}, {"text_en": "The interest rates are very low.", "value": "The interest rates are very low."}, {"text_en": "The borrowers become rich from the loans.", "value": "The borrowers become rich from the loans."}]}, {"type": "scq", "sentence": "One way fatima serwonas loan helped her community was by .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Making her wealthier than her neighbors", "value": "Making her wealthier than her neighbors"}, {"text_en": "Giving villagers a way to make phone calls", "value": "Giving villagers a way to make phone calls"}, {"text_en": "Helping villagers get their own loans", "value": "Helping villagers get their own loans"}, {"text_en": "Sending children from her village to school", "value": "Sending children from her village to school"}]}, {"type": "scq", "sentence": "Based on information in the passage, which statement about fatimas village is most likely true?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Many people own their own stores.", "value": "Many people own their own stores."}, {"text_en": "All of the children go to school.", "value": "All of the children go to school."}, {"text_en": "Most people receive microfinance loans.", "value": "Most people receive microfinance loans."}, {"text_en": "Few people have phone service.", "value": "Few people have phone service."}]}]}