{"lesson": {"type": "sentence", "title": "The Value Of Gold", "sentence": "People have treasured gold for thousands of years. But just what makes gold so valuable? Gold has several important properties that contribute to its value. First, it reflects light very well and has an attractive yellow color, making it ideal for use in jewelry. Second, it is very malleable, or easy to shape. Because gold is soft and easy to work with, it can be hammered into thin sheets that do not crack. These sheets can then be used to add decorative details to artwork or buildings. Third, it does not rust or wear away. It keeps its shape, which means that gold jewelry and art objects can pass from generation to generation and become more valuable over time. Fourth, gold is an excellent conductor of electricity, making it a good choice for electronics. One of the most important reasons that gold is valuable, however, is that it is rare. Although gold exists in many places throughout the world, it is not easy to find or to mine. People who mine gold usually have to work very hard to get even tiny amounts of the precious metal. The fact that it is both beautiful and useful makes people want more of this precious metal than they can easily get, which drives up its price. Finally, gold is valuable because people perceive it to be a symbol of wealth. Throughout recorded history, gold has been associated with wealth and power. Today we still value it for many of the same reasons that our ancestors did.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "What evidence does the author use to support the idea that gold is ideal for use in jewelry?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "It reflects light well and is pretty.", "value": "It reflects light well and is pretty."}, {"text_en": "It is very malleable and conducts electricity.", "value": "It is very malleable and conducts electricity."}, {"text_en": "It is rare and hard to mine.", "value": "It is rare and hard to mine."}, {"text_en": "It has a high price and is used to decorate buildings.", "value": "It has a high price and is used to decorate buildings."}]}, {"type": "scq", "sentence": "Which piece of evidence explains why gold is commonly used in electronics?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "It reflects light well.", "value": "It reflects light well."}, {"text_en": "It conducts electricity well.", "value": "It conducts electricity well."}, {"text_en": "It is very malleable.", "value": "It is very malleable."}, {"text_en": "It keeps its shape.", "value": "It keeps its shape."}]}, {"type": "scq", "sentence": "Which statement does not explain why gold is valuable?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Gold has several properties that make it useful.", "value": "Gold has several properties that make it useful."}, {"text_en": "Gold is desirable for making jewelry and other objects.", "value": "Gold is desirable for making jewelry and other objects."}, {"text_en": "Gold is difficult to mine.", "value": "Gold is difficult to mine."}, {"text_en": "Gold has been treasured for thousands of years.", "value": "Gold has been treasured for thousands of years."}]}, {"type": "scq", "sentence": "Which statement best supports the idea that gold is rare?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "It is associated with wealth and power.", "value": "It is associated with wealth and power."}, {"text_en": "It is both beautiful and useful.", "value": "It is both beautiful and useful."}, {"text_en": "It is not easy to find or to mine.", "value": "It is not easy to find or to mine."}, {"text_en": "It is soft and easy to work with.", "value": "It is soft and easy to work with."}]}]}