{"lesson": {"type": "sentence", "title": "Wildfires In Washington", "sentence": "Wildfires take place with alarming frequency in the drier areas of the United States, especially in the western states. Not only do the fires cause immediate damage by killing plants and animals in their path, but they can also have long-term effects that harm the ecosystem. At the Hanford Reach National Monument in Washington State, different types of wildlife—such as the burrowing owl, the sagebrush vole, and the pygmy rabbit—abound. Visitors to Hanford Reach might also see elk, porcupines, and jack rabbits that live near the free-flowing Columbia River. The area is protected from development, which has helped these species thrive. Over the last decade, several major wildfires have broken out at Hanford Reach. Thousands of acres have burned. One type of plant that has been severely damaged in the fires is sagebrush. This poses special problems for many of the species living in the park. First, animals such as the sage grouse depend on sagebrush as part of their natural habitat. It can take thirty years for sagebrush to grow large enough to provide shelter for these animals. Second, after the sagebrush burns, an invasive species called cheat grass can grow quickly in its place. Unfortunately, cheat grass burns more easily and at higher temperatures than sagebrush. That means that after sagebrush is destroyed, wildfires can occur more frequently and be even more devastating.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "According to the passage, which is one immediate effect of wildfires?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "People stop visiting the area.", "value": "People stop visiting the area."}, {"text_en": "Cheat grass grows.", "value": "Cheat grass grows."}, {"text_en": "Plants are killed.", "value": "Plants are killed."}, {"text_en": "Animals must learn to live in new habitats.", "value": "Animals must learn to live in new habitats."}]}, {"type": "scq", "sentence": "According to the author, why is it a problem when sagebrush burns in a fire?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Animals move into the area where the sagebrush grew.", "value": "Animals move into the area where the sagebrush grew."}, {"text_en": "Sagebrush can take many years to grow large enough to provide shelter.", "value": "Sagebrush can take many years to grow large enough to provide shelter."}, {"text_en": "Young sagebrush plants grow rapidly and stop other species from growing.", "value": "Young sagebrush plants grow rapidly and stop other species from growing."}, {"text_en": "Sagebrush burns hotter and more easily than other grasses.", "value": "Sagebrush burns hotter and more easily than other grasses."}]}, {"type": "scq", "sentence": "How are species protected at hanford reach national monument?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "There are limits on land development there.", "value": "There are limits on land development there."}, {"text_en": "Wildfires rarely occur there.", "value": "Wildfires rarely occur there."}, {"text_en": "National park workers take care of them.", "value": "National park workers take care of them."}, {"text_en": "Cheat grass provides a habitat for them.", "value": "Cheat grass provides a habitat for them."}]}, {"type": "scq", "sentence": "In the passage, which of the following is not a long-term effect of wildfires in hanford reach national monument?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Animals lose their habitat.", "value": "Animals lose their habitat."}, {"text_en": "Cheat grass replaces sagebrush.", "value": "Cheat grass replaces sagebrush."}, {"text_en": "More destructive wildfires may occur.", "value": "More destructive wildfires may occur."}, {"text_en": "People clear forests to help them regrow.", "value": "People clear forests to help them regrow."}]}]}