{"lesson": {"type": "sentence", "title": "Eating The Roman Way Today", "sentence": "It’s hard to believe that there could be many similarities between the way we eat today and the diet and eating habits of ancient Romans. However, excavations at the ancient Roman towns of Pompeii and nearby Herculaneum have uncovered at least one significant parallel. Romans enjoyed convenient ways to get their food and ate on the go, just as we do today. Buying baked bread is one example of a convenience in both the ancient and modern worlds. Most people today purchase bread in a store. There is evidence that Romans bought their bread, too, rather than baking it themselves. A large wall painting in Pompeii shows customers buying loaves of bread in a shop. Archaeologists have identified more than 30 shops that may have been bakeries. Signs on walls told Roman shoppers that certain vendors sold bread. In addition to these discoveries, archaeologists found that few homes in Pompeii had ovens, which suggests that most people did not bake at home. Ancient Romans also had a version of take-out food. Pompeii is filled with shops that contain dishes to hold or display food. Many shops had built-in stoves that allowed them to cook and serve food. Types of foods that have been found in these shops include dates and lentils. Archaeologists have also uncovered many houses with small barbecue grills. However, few of these houses had sets of dishes. Taken together, these pieces of evidence suggest that Romans frequently grabbed a quick bite to eat at home, right off the grill, or bought a meal to go. Sound familiar?", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "The passage mainly compares and contrasts ancient and modern .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Food shops and stores", "value": "Food shops and stores"}, {"text_en": "Favorite foods", "value": "Favorite foods"}, {"text_en": "Cooking and eating habits", "value": "Cooking and eating habits"}, {"text_en": "Cities and homes", "value": "Cities and homes"}]}, {"type": "scq", "sentence": "Which feature of life for ancient romans would most likely not apply to people today?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Having a home with no oven", "value": "Having a home with no oven"}, {"text_en": "Buying bread from a bakery", "value": "Buying bread from a bakery"}, {"text_en": "Getting a take-out meal", "value": "Getting a take-out meal"}, {"text_en": "Having a grill but not dishes", "value": "Having a grill but not dishes"}]}, {"type": "scq", "sentence": "What could you probably find today that you would not have found in ancient rome?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Barbecue grills in houses", "value": "Barbecue grills in houses"}, {"text_en": "Dishes in homes", "value": "Dishes in homes"}, {"text_en": "Signs in shops", "value": "Signs in shops"}, {"text_en": "Stores that sell food", "value": "Stores that sell food"}]}, {"type": "scq", "sentence": "Based on information in the passage, how are people today like ancient romans?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "People today eat meals together as a family.", "value": "People today eat meals together as a family."}, {"text_en": "People today eat foods that someone else prepared.", "value": "People today eat foods that someone else prepared."}, {"text_en": "People today spend a lot of money on take-out food.", "value": "People today spend a lot of money on take-out food."}, {"text_en": "People today cook food at home when we have time.", "value": "People today cook food at home when we have time."}]}]}