{"lesson": {"type": "sentence", "title": "A Diagnosis", "sentence": "Every Sunday at exactly 11:00 am, my whole family gathers in the lobby of the Oak Valley Manor for Senior Citizens. That’s when my parents, my brother Phillip, and I join my great-grandmother June for Sunday brunch, a spectacular buffet of omelets, pancakes, French toast, and all the other foods people don’t usually have time to prepare or get to eat during the school week. Something different about Sunday brunch lately was the change in Dr. Shepard, a friend of my Great-Grandma June, who eats brunch with us. When I first met Dr. Shepard, he used a walker to get around but still stood straight and tall and always smiled. Lately he seemed to move more slowly, hunched over his walker, and rarely smiled. Recently, our dog Scout had been tired and hadn’t wanted to play. Since pets are allowed in the Manor on Sundays, we decided to bring Scout along. As we walked in, we heard someone holler, “Come, Scout!” From a nearby chair, Dr. Shepard reached out his arms. Scout ran to him, her tail wagging wildly. He scratched behind Scout’s ears and gently rubbed her belly. “Dogs are the best!” he said. “And I should know. I used to be a vet.” “Wow, you were that kind of doctor? Maybe you can figure out what’s wrong with Scout.” Dr. Shepard chuckled. “Maybe I can!” And with a huge smile he added, “Go ahead and join your family. I’ll stay right here with Scout and see if I can make a diagnosis.”", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "What change does the narrator notice about dr. shepard before dr. shepard sees scout?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Dr. shepard no longer joins the family for brunch.", "value": "Dr. shepard no longer joins the family for brunch."}, {"text_en": "Dr. shepard moves more slowly and smiles less often.", "value": "Dr. shepard moves more slowly and smiles less often."}, {"text_en": "Dr. shepard is healthier and happier.", "value": "Dr. shepard is healthier and happier."}, {"text_en": "Dr. shepard is no longer friends with great-grandma june.", "value": "Dr. shepard is no longer friends with great-grandma june."}]}, {"type": "scq", "sentence": "What is the main idea of the passage?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "A family brings their dog scout to see a vet.", "value": "A family brings their dog scout to see a vet."}, {"text_en": "The manor has a great buffet every sunday.", "value": "The manor has a great buffet every sunday."}, {"text_en": "Scout and dr. shepard are not feeling well but may be able to help each other.", "value": "Scout and dr. shepard are not feeling well but may be able to help each other."}, {"text_en": "The family visits great-grandma june at oak valley manor every sunday.", "value": "The family visits great-grandma june at oak valley manor every sunday."}]}, {"type": "scq", "sentence": "Which detail from the passage tells you that something is wrong with scout?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Scout is tired.", "value": "Scout is tired."}, {"text_en": "Scout runs to dr. shepard.", "value": "Scout runs to dr. shepard."}, {"text_en": "Scout wags her tail wildly.", "value": "Scout wags her tail wildly."}, {"text_en": "Scout visits the manor.", "value": "Scout visits the manor."}]}, {"type": "scq", "sentence": "What does the family normally do at oak valley manor?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "They take scout to see dr. shepard.", "value": "They take scout to see dr. shepard."}, {"text_en": "They eat brunch with great-grandma june.", "value": "They eat brunch with great-grandma june."}, {"text_en": "They spend the morning with scout.", "value": "They spend the morning with scout."}, {"text_en": "They pick up great-grandma june for a day out.", "value": "They pick up great-grandma june for a day out."}]}]}