{"lesson": {"type": "sentence", "title": "The Return Of The Wolf", "sentence": "Wolves once prospered in Yellowstone National Park, but by 1926, humans had hunted them to extinction there. The absence of wolves affected many parts of the Yellowstone ecosystem. Most significantly, the disappearance of wolves led to a huge increase in the number of elk. This in turn had negative effects on plants and animals in the park. Park authorities tried to keep the elk population under control by hunting, but in the late 1960s and 1970s, the U.S. government and the park managers began considering a new policy. They wanted to return to natural processes for regulating the balance of wildlife in the park. In 1995, Congress authorized reintroducing the gray wolf to Yellowstone. The first wolves were brought in from Canada a year later. Almost immediately, authorities noticed differences in the park. As a result of the reintroduction of wolves, the number of elk declined. This led to an unexpected change. The number of willow trees and aspen, which elk eat, increased. Beavers, which feed on willows, in turn grew more numerous. In addition, the populations of some songbird species and small mammals that live in aspen stands have since grown. Other animals and people have benefited, too. Scavengers, or animals that eat dead animals, have increased in number. And visitors to Yellowstone are able to see and hear wolves in the park again.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "Which is most likely the reason the elk population grew when wolves disappeared from yellowstone?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Elk were able to find better shelter.", "value": "Elk were able to find better shelter."}, {"text_en": "Elk moved into the wolves territory.", "value": "Elk moved into the wolves territory."}, {"text_en": "Elk were not being hunted by wolves.", "value": "Elk were not being hunted by wolves."}, {"text_en": "Elk were eating more willow and aspen trees.", "value": "Elk were eating more willow and aspen trees."}]}, {"type": "scq", "sentence": "Why do you think the park managers and the u.s. government wanted a new strategy for dealing with elk in the park?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Because their old strategy did not work well", "value": "Because their old strategy did not work well"}, {"text_en": "Because voters wanted more wolves in parks", "value": "Because voters wanted more wolves in parks"}, {"text_en": "Because of the growing beaver problem", "value": "Because of the growing beaver problem"}, {"text_en": "Because hunters wanted to hunt more animals", "value": "Because hunters wanted to hunt more animals"}]}, {"type": "scq", "sentence": "Why might the number of scavengers have grown when wolves returned to yellowstone?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "The elk stopped eating scavengers food.", "value": "The elk stopped eating scavengers food."}, {"text_en": "New visitors to yellowstone left food behind for scavengers.", "value": "New visitors to yellowstone left food behind for scavengers."}, {"text_en": "The wolves caused an increase in beavers, which scavengers eat.", "value": "The wolves caused an increase in beavers, which scavengers eat."}, {"text_en": "Scavengers could eat the remains of animals that wolves had killed.", "value": "Scavengers could eat the remains of animals that wolves had killed."}]}, {"type": "scq", "sentence": "The vegetation of yellowstone probably suffered when wolves were gone because .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Elk ate too many plants", "value": "Elk ate too many plants"}, {"text_en": "There were no wolves to eat the plants", "value": "There were no wolves to eat the plants"}, {"text_en": "There were more beavers to eat the plants", "value": "There were more beavers to eat the plants"}, {"text_en": "Too many songbirds nested in the plants", "value": "Too many songbirds nested in the plants"}]}]}