{"lesson": {"type": "sentence", "title": "Helping Horses", "sentence": "Many people with visual impairment use guide dogs to help them get safely from place to place and to alert them to danger. But what can blind people do if they are allergic to dogs or just don’t like them? For some people, the answer is provided by the Guide Horse Foundation. Janet and Don Burleson founded the nonprofit organization in 1999. They began training miniature horses to help guide visually impaired people. Miniature horses look just like regular horses, only much smaller. They are generally less than 34 inches tall. Cuddles was the foundation’s first guide horse in full service. She became 45-year-old Dan Shaw’s helper. Shaw has an eye disease that caused his sight to deteriorate. One night, while filling out an application to get a guide dog, Shaw heard a news story on TV about people training horses to guide the blind. Shaw loves horses and wanted a guide animal that would live a long time. He applied, and a year later, Cuddles and Shaw began training as a team. On a trip to New York, Cuddles helped Shaw safely navigate Times Square, a very busy part of the city at night. The next day, Cuddles calmly rode the elevator with Shaw to the crowded top of the Empire State Building, a famous skyscraper. Cuddles even guided Shaw on the ferry ride to the Statue of Liberty, rode the escalator in a store, and traveled on the subway system. Shaw says that he feels truly blessed to have Cuddles. He believes that Cuddles has changed his life for the better by giving him more independence and self-reliance.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "How did people probably feel when they saw cuddles in new york city?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Annoyed that the horse blocked traffic", "value": "Annoyed that the horse blocked traffic"}, {"text_en": "Surprised by seeing a miniature horse in a building", "value": "Surprised by seeing a miniature horse in a building"}, {"text_en": "Disappointed that shaw did not have a guide dog", "value": "Disappointed that shaw did not have a guide dog"}, {"text_en": "Pleased that cuddles is very cute", "value": "Pleased that cuddles is very cute"}]}, {"type": "scq", "sentence": "You can tell that an important quality for a guide horse is .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Having the ability to handle many situations", "value": "Having the ability to handle many situations"}, {"text_en": "Being small in size", "value": "Being small in size"}, {"text_en": "Being independent", "value": "Being independent"}, {"text_en": "Having the ability to run quickly", "value": "Having the ability to run quickly"}]}, {"type": "scq", "sentence": "How did cuddles change dan shaws life?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "She became dan shaws best friend.", "value": "She became dan shaws best friend."}, {"text_en": "She made dan shaw famous.", "value": "She made dan shaw famous."}, {"text_en": "She helped dan shaw start a business.", "value": "She helped dan shaw start a business."}, {"text_en": "She gave dan shaw confidence.", "value": "She gave dan shaw confidence."}]}, {"type": "scq", "sentence": "Which of these is a theme in the passage?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Visually impaired people are brave for facing many challenging situations.", "value": "Visually impaired people are brave for facing many challenging situations."}, {"text_en": "Animals are special because they can help people do otherwise impossible things.", "value": "Animals are special because they can help people do otherwise impossible things."}, {"text_en": "Horses are better than dogs as guide animals.", "value": "Horses are better than dogs as guide animals."}, {"text_en": "New york city is a magical city with unique attractions.", "value": "New york city is a magical city with unique attractions."}]}]}