{"lesson": {"type": "sentence", "title": "The Dog Hoser", "sentence": "The United States has been the birthplace of thousands of important inventions, from the incandescent light bulb to the computer mouse. However, the U.S. has also seen the birth of thousands of wacky and even ridiculous inventions. One example of an odd invention is the dog hoser. Grooming a dog at home can be difficult. Many dog owners don’t have the tools or knowledge needed to properly cut an animal’s fur. For these reasons, some dog owners take their animals to professional groomers for haircuts. After groomers cut a dog’s fur, they often use a vacuum cleaner to remove the cut fur from the pet’s coat. This is where the real trouble starts. Many dogs are terrified of the strange machine and its scary noise. To solve the problem, one creative inventor designed a vacuum cleaner dogs might actually like. The dog hoser is a vacuum cleaner that looks just like a dog. Dog-shaped, with a vacuum cleaner hidden in its belly, the dog hoser looks like a furry pal. Its sound is muffled, and the hose is disguised as the dog’s tail. It may look like a new friend, but what do you think happens when the groomer pulls out the dog hoser’s tail and starts sweeping it across the dog’s body? After trying one in his shop, one dog groomer said, “My client’s expensive poodle cowered in fear when I used it.” A month later, the client reported that her dog was still afraid of interacting with other dogs.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "What might happen when a groomer tries using the dog hoser on a dog?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "The dog might cuddle up to the dog hoser.", "value": "The dog might cuddle up to the dog hoser."}, {"text_en": "The dog hosers tail might fall off.", "value": "The dog hosers tail might fall off."}, {"text_en": "The dog might be afraid.", "value": "The dog might be afraid."}, {"text_en": "The dog might want to share its toys with the new dog.", "value": "The dog might want to share its toys with the new dog."}]}, {"type": "scq", "sentence": "In the future, most dog owners who want their dogs groomed will probably .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Not worry about cleaning up clipped fur", "value": "Not worry about cleaning up clipped fur"}, {"text_en": "Buy the tools to groom their dogs at home", "value": "Buy the tools to groom their dogs at home"}, {"text_en": "Choose dog breeds that do not need haircuts", "value": "Choose dog breeds that do not need haircuts"}, {"text_en": "Continue going to professional groomers", "value": "Continue going to professional groomers"}]}, {"type": "scq", "sentence": "Based on information in the passage, what do you predict happened with the dog hoser?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "It made a lot of money for the inventor.", "value": "It made a lot of money for the inventor."}, {"text_en": "It became a popular solution for home grooming.", "value": "It became a popular solution for home grooming."}, {"text_en": "Most groomers began using it.", "value": "Most groomers began using it."}, {"text_en": "It confused and frightened most dogs.", "value": "It confused and frightened most dogs."}]}, {"type": "scq", "sentence": "What kinds of things will people probably invent in the future?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Only inventions that people find useful", "value": "Only inventions that people find useful"}, {"text_en": "Both important and wacky inventions", "value": "Both important and wacky inventions"}, {"text_en": "Only wacky inventions", "value": "Only wacky inventions"}, {"text_en": "Only inventions that sell well", "value": "Only inventions that sell well"}]}]}