{"lesson": {"type": "sentence", "title": "Dirty Job? Oh Yeah!", "sentence": "“You couldn’t pay me to do that job!” Have you ever said that? Some occupations are so gross that most people would never be willing to do them. Jeff Biggs has a job like that, but he likes it. He’s the kind of guy who, as a kid, loved to slosh around in mud after a rainstorm, the kind of kid who loved squeezing oatmeal through his fingers. Biggs’s dirty job is being a sewer inspector. “Believe me,” says Biggs, “gross doesn’t come close to describing it; I creep, sometimes swim, through sewage all day.” City sewers carry household wastewater and storm-drain runoff to water treatment plants. In addition to the unpleasant smells, sewer tunnels are home to creatures such as cockroaches and rats. And these creatures aren’t shy. What is it like to do a really disgusting job day after day? “Someone has to do it,” says Biggs. “I seriously can’t imagine sitting in an office all day, and I earn a good salary. At the end of my workday, I’ve accomplished something, and I’ve helped to keep our city’s water clean and drinkable.” And after work? “I don’t walk into the house right away,” explains Biggs. “We installed the washing machine in the garage and put a shower stall in there, too. I toss my clothes into the washer, take a shower, and dress in clean clothes. Then I greet my family. Of course, sometimes, the clothes go into the trash, not the washer.”", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "Which adjectives best describe jeff biggs?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Flashy, conceited, loud", "value": "Flashy, conceited, loud"}, {"text_en": "Positive, upbeat, thoughtful", "value": "Positive, upbeat, thoughtful"}, {"text_en": "Smart, wealthy, nervous", "value": "Smart, wealthy, nervous"}, {"text_en": "Negative, shy, withdrawn", "value": "Negative, shy, withdrawn"}]}, {"type": "scq", "sentence": "Which adjective best describes the setting in which biggs works?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Disgusting", "value": "Disgusting"}, {"text_en": "Boring", "value": "Boring"}, {"text_en": "Pleasant", "value": "Pleasant"}, {"text_en": "Appealing", "value": "Appealing"}]}, {"type": "scq", "sentence": "Which sentence best describes the central message of the passage?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Biggss job embarrasses him.", "value": "Biggss job embarrasses him."}, {"text_en": "Biggs cannot imagine having a nicer job.", "value": "Biggs cannot imagine having a nicer job."}, {"text_en": "Biggs is proud of the work he does.", "value": "Biggs is proud of the work he does."}, {"text_en": "Biggs is just doing his job until he gets a better one.", "value": "Biggs is just doing his job until he gets a better one."}]}, {"type": "scq", "sentence": "Which one would jeff biggs probably most enjoy being?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "A lawyer", "value": "A lawyer"}, {"text_en": "A poet", "value": "A poet"}, {"text_en": "A computer programmer", "value": "A computer programmer"}, {"text_en": "A deep-sea diver", "value": "A deep-sea diver"}]}]}