{"lesson": {"type": "sentence", "title": "Harvesting Rain The Easy Way", "sentence": "As people in the American Southwest become concerned about long periods of drought, many are rediscovering water-harvesting techniques from ancient times. Water harvesting is the capturing, moving, and storing of rainwater for later use, often in landscaping. Rain barrels attached to a roof’s downspouts are one low-tech way of harvesting rainwater, but an even simpler and cheaper method is to build swales and berms. What are swales? Swales are simply depressions, or low areas, in the ground. They allow rainwater to stay put for a while so that it can soak into the soil. This enables fruit trees, vegetable gardens, and landscape plants to use it as needed. And berms? Berms are raised areas that direct water into swales. One simple way to create berms and swales is to dig a hole in the soil about a foot deep and pile up that same dirt to create a berm around it. The dirt is then pounded down to form a sturdy wall around the swale. Doing this over and over can create a whole network of berms and swales. Boomerang-shaped berms can direct water toward trees or other plants. Repeating serpentine-shaped berms can provide the water needed to turn a barren slope into a beautiful garden. And it’s easier than you think. Once again, a low-tech approach works just fine! Just gather your friends, provide plenty of lemonade and music, and have a swale-stomping dance party in your yard.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "What was the authors main purpose in writing the passage?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "To entertain by describing fun ways to move dirt", "value": "To entertain by describing fun ways to move dirt"}, {"text_en": "To persuade people to conserve water", "value": "To persuade people to conserve water"}, {"text_en": "To explain a method for using rainwater", "value": "To explain a method for using rainwater"}, {"text_en": "To inform about drought in the southwest", "value": "To inform about drought in the southwest"}]}, {"type": "scq", "sentence": "Which word best describes the authors attitude toward harvesting rainwater?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Doubtful", "value": "Doubtful"}, {"text_en": "Humorous", "value": "Humorous"}, {"text_en": "Serious", "value": "Serious"}, {"text_en": "Enthusiastic", "value": "Enthusiastic"}]}, {"type": "scq", "sentence": "What does the author want readers to know about berms and swales?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Building them is simple and effective.", "value": "Building them is simple and effective."}, {"text_en": "They help people build a sense of community.", "value": "They help people build a sense of community."}, {"text_en": "Using them is expensive but worthwhile.", "value": "Using them is expensive but worthwhile."}, {"text_en": "They are beautiful, as well as useful.", "value": "They are beautiful, as well as useful."}]}, {"type": "scq", "sentence": "Which of these statements about harvesting rainwater would the author likely agree with?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Big city water systems make it unnecessary.", "value": "Big city water systems make it unnecessary."}, {"text_en": "It is more important today than in the past.", "value": "It is more important today than in the past."}, {"text_en": "High-tech solutions provide the best approach.", "value": "High-tech solutions provide the best approach."}, {"text_en": "It is a good technique for watering landscapes.", "value": "It is a good technique for watering landscapes."}]}]}