{"lesson": {"type": "sentence", "title": "One School At A Time", "sentence": "Greg Mortenson is an adventurer who once loved to climb mountains. Born in 1957, he grew up on the slopes of Mt. Kilimanjaro in Tanzania, Africa. After his sister Christa died in 1992, he decided to try climbing Pakistan’s K2, the second-highest mountain in the world, in her memory. Although Mt. Everest in the Himalaya Mountains is higher, K2 is considered more difficult and treacherous to climb. During an attempt to climb the mountain in 1993, snow, ice, and bad weather forced Mortenson to turn back. Mortenson recovered from frostbite and exhaustion in the rural Pakistani village of Korphe. There he saw a group of children writing in the dirt with sticks. He learned that they had no pens or pencils, no books—not even a school or a teacher. Mortenson promised to build them a school, even though he had no idea how he would accomplish it. It took years to raise the money to build the school. Some of the contributions to Mortenson’s cause came as pennies donated by American schoolchildren. Mortenson even sold his own belongings to raise cash. The Korphe School was finished in 1996. Since then, Mortenson has established more than 75 schools in rural Pakistan and Afghanistan. His schools educate both boys and girls in an area where schooling for girls is very rare. Mortenson’s aim is to use education to promote peace in this often dangerous and violent area, one school at a time.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "Based on information in the passage, which word best describes what k2 is like?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Familiar", "value": "Familiar"}, {"text_en": "Beautiful", "value": "Beautiful"}, {"text_en": "Comforting", "value": "Comforting"}, {"text_en": "Dangerous", "value": "Dangerous"}]}, {"type": "scq", "sentence": "Which word best describes mortensons behavior in paragraph 1?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Adventurous", "value": "Adventurous"}, {"text_en": "Hopeful", "value": "Hopeful"}, {"text_en": "Reckless", "value": "Reckless"}, {"text_en": "Fearful", "value": "Fearful"}]}, {"type": "scq", "sentence": "How did the village of korphe change mortensons life?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "It inspired him to become a teacher.", "value": "It inspired him to become a teacher."}, {"text_en": "It motivated him to climb mountains.", "value": "It motivated him to climb mountains."}, {"text_en": "It inspired him to build schools.", "value": "It inspired him to build schools."}, {"text_en": "It motivated him to create a memorial for his sister.", "value": "It motivated him to create a memorial for his sister."}]}, {"type": "scq", "sentence": "Mortensons actions in paragraphs 2 and 3 show that he is .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Stubborn and argumentative", "value": "Stubborn and argumentative"}, {"text_en": "Caring and determined", "value": "Caring and determined"}, {"text_en": "Clever and ambitious", "value": "Clever and ambitious"}, {"text_en": "Frustrated and angry", "value": "Frustrated and angry"}]}]}