{"lesson": {"type": "sentence", "title": "The Most Powerful Thing In The World", "sentence": "Long ago, there lived a man who worked as a humble stonecutter. He was not happy with his job or his position in life. As he struggled at his work, chipping away at stone, he saw a wealthy merchant pass by and thought, “How I wish I were as powerful and influential as that merchant!” Suddenly, the stonecutter was transformed into a wealthy and powerful merchant. Others now envied him. One hot day, as the wealthy man walked around the town observing all that he owned, he became annoyed by the strength of the sun’s rays. “How I wish I were as powerful as the sun!” he thought, and suddenly he became the sun, scorching others with his heat and brilliance. Then one day a dark cloud crossed beneath him. Rain poured down and the wind blew, limiting the sun’s power over others. “How I wish I were as powerful as the storm!” he thought, and he became a storm with rain and wind. People feared his great force, but when he blew against a huge rock, the rock did not move. “How I wish I were as powerful as that rock!” he thought, and in a moment he became the rock. Not long afterward, he heard a hammering sound and felt a part of himself change. “What could be more powerful than me, the rock?” he wondered. He looked down and saw, much to his surprise and disappointment, that a humble stonecutter was chipping away at him.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "The stonecutter wants to be like the merchant because .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "He wants to be feared like the merchant", "value": "He wants to be feared like the merchant"}, {"text_en": "The merchant is important", "value": "The merchant is important"}, {"text_en": "The merchant is humble", "value": "The merchant is humble"}, {"text_en": "He wants to be envied like the merchant", "value": "He wants to be envied like the merchant"}]}, {"type": "scq", "sentence": "Why is the stonecutter unhappy with each new thing he becomes?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "He always sees something more powerful.", "value": "He always sees something more powerful."}, {"text_en": "He does not like being envied.", "value": "He does not like being envied."}, {"text_en": "He wants people to like him.", "value": "He wants people to like him."}, {"text_en": "He misses his life as a stonecutter.", "value": "He misses his life as a stonecutter."}]}, {"type": "scq", "sentence": "Which of these is the most powerful in the passage?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "The stonecutter", "value": "The stonecutter"}, {"text_en": "The merchant", "value": "The merchant"}, {"text_en": "The storm", "value": "The storm"}, {"text_en": "The rock", "value": "The rock"}]}, {"type": "scq", "sentence": "A theme of the passage is that people .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Should always wish for what they want", "value": "Should always wish for what they want"}, {"text_en": "Are all powerful in their own way", "value": "Are all powerful in their own way"}, {"text_en": "Will be happy with whatever they become in life", "value": "Will be happy with whatever they become in life"}, {"text_en": "Should seek wealth and power", "value": "Should seek wealth and power"}]}]}