{"lesson": {"type": "sentence", "title": "A Wild Flamingo Chase", "sentence": "Rodney read the headline in the local paper: “Flamingo Flocks to Fern Fields.” An exotic bird had found its way to his small California town. It was a flamingo, the report said, a real one—not like the faded, plastic version planted in Rodney’s neighbor’s yard. The town didn’t even have a zoo, so this news was really exciting. But where was the bird? Rodney thought it would stick out like a sore thumb. Only one man in town claimed to have seen the wild bird, in a wetland park on the outskirts of town. He described the flamingo’s pink feathers and said it stood approximately 3 feet tall. He also said the flamingo did not seem sick or hurt. Rodney thought the story sounded suspicious, though, so he decided to go on a flamingo-finding expedition. He also decided to take his best friend, Paul, with him. “If we find it,” Rodney said, “we can write a report on protecting wild species.” The boys assembled their gear—tall rubber boots, binoculars, and a camera. They packed some peanut butter sandwiches, too. Then they set out for the wetlands. With boots up to their thighs, Rodney and Paul trudged through muck and mud for what seemed like an eternity, but they never spotted the flamingo. Finally the sun began to set, and a cold wind cut through the boys’ jackets. Rodney and Paul decided to head home. As they turned onto Paul’s dark street, they saw Paul’s mom waiting on the porch. Paul dragged his feet up the driveway. His mother put her arm on his shoulder, and the two went inside. Rodney continued down the street toward his house, past his neighbor’s yard and that ridiculous plastic pink flamingo. “Great,” Rodney thought, “now they have a pair.” Out of the corner of his eye, Rodney saw something move.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "What is the authors purpose in this passage?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "To tell you facts about flamingos", "value": "To tell you facts about flamingos"}, {"text_en": "To entertain you with a story about two friends", "value": "To entertain you with a story about two friends"}, {"text_en": "To teach you how to study birds", "value": "To teach you how to study birds"}, {"text_en": "To persuade people not to study flamingos", "value": "To persuade people not to study flamingos"}]}, {"type": "scq", "sentence": "What will paul probably tell his mom?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "He will recall the dangers of walking through the wetlands.", "value": "He will recall the dangers of walking through the wetlands."}, {"text_en": "He will admit that they lost the sandwiches.", "value": "He will admit that they lost the sandwiches."}, {"text_en": "He will express disappointment for not spotting the flamingo.", "value": "He will express disappointment for not spotting the flamingo."}, {"text_en": "He will say he is excited about being home.", "value": "He will say he is excited about being home."}]}, {"type": "scq", "sentence": "Why does the author say the flamingo is exotic?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "To let you know that the flamingo is not a native species", "value": "To let you know that the flamingo is not a native species"}, {"text_en": "To tell you how beautiful the flamingo is", "value": "To tell you how beautiful the flamingo is"}, {"text_en": "To tell you how expensive the flamingo is", "value": "To tell you how expensive the flamingo is"}, {"text_en": "To let you know that rodney is intelligent", "value": "To let you know that rodney is intelligent"}]}, {"type": "scq", "sentence": "Which of these is most likely to happen next?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Rodney will look again at the flamingos on the lawn.", "value": "Rodney will look again at the flamingos on the lawn."}, {"text_en": "Rodney will return to the wetlands.", "value": "Rodney will return to the wetlands."}, {"text_en": "Rodney will put a flamingo in his yard.", "value": "Rodney will put a flamingo in his yard."}, {"text_en": "Paul will go to rodneys house for dinner.", "value": "Paul will go to rodneys house for dinner."}]}]}