{"lesson": {"type": "sentence", "title": "The Elephant And The Hummingbird", "sentence": "Long, long ago—in the days when people could talk to animals and learn their stories—an elephant walked slowly beside the Yellow River. This was before animals were tamed, even before the first Chinese emperors ruled. That’s how long ago it was. The elephant was enjoying a peaceful stroll. Thick grasses and beautiful lotus flowers bloomed, and the water in the Yellow River made a pleasant swishing sound as it flowed past the elephant. Noticing what appeared to be a hummingbird, the elephant stopped. Although they don’t exist in China today, the elephant had seen hummingbirds before. He’d watched them hover above lotus flowers, their wings beating so quickly that they appeared only as a blur. The elephant sometimes wished he could move as quickly as a hummingbird. This one, however, was lying upside down, her wings motionless and her legs pointing toward the sky. Occasionally, the little bird would sigh heavily or grunt, as if working extra hard. “What are you doing?” asked the elephant. He slowly walked around the hummingbird, trying to understand the odd behavior. “You look ridiculous, you know.” “I am holding up the sky,” replied the hummingbird calmly. “I overheard that it might fall today.” The elephant raised his trunk and made a sound that today might pass as a deep laugh. “You’re holding up the sky? Why, just look at it. The sky is bigger than I am, and I doubt you could hold me up. Even if the sky were going to fall, your tiny legs could not possibly do the job.” “Ah,” said the hummingbird, “but these are the only legs I have. I might not be able to do it by myself, but I am doing what I can.”", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "Where and when does the folk tale take place?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "On a ship on the yellow river", "value": "On a ship on the yellow river"}, {"text_en": "On a yellow river bridge around ad 1400", "value": "On a yellow river bridge around ad 1400"}, {"text_en": "In a chinese flower garden", "value": "In a chinese flower garden"}, {"text_en": "Beside a river in ancient china", "value": "Beside a river in ancient china"}]}, {"type": "scq", "sentence": "How does the elephant probably feel about what the hummingbird is doing?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "He thinks she is smart.", "value": "He thinks she is smart."}, {"text_en": "He thinks she is arrogant.", "value": "He thinks she is arrogant."}, {"text_en": "He thinks she is wasting her time.", "value": "He thinks she is wasting her time."}, {"text_en": "He thinks she is selfish.", "value": "He thinks she is selfish."}]}, {"type": "scq", "sentence": "What is the message of the folk tale?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "People do what they can with what they have.", "value": "People do what they can with what they have."}, {"text_en": "Past wisdom is better than present wisdom.", "value": "Past wisdom is better than present wisdom."}, {"text_en": "It is always best not to look ridiculous.", "value": "It is always best not to look ridiculous."}, {"text_en": "It is risky to try things that other people say are impossible.", "value": "It is risky to try things that other people say are impossible."}]}, {"type": "scq", "sentence": "Which of these conflicts is important in the story?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Good vs. evil", "value": "Good vs. evil"}, {"text_en": "Trying vs. watching", "value": "Trying vs. watching"}, {"text_en": "Strength vs. weakness", "value": "Strength vs. weakness"}, {"text_en": "Being tame vs. being free", "value": "Being tame vs. being free"}]}]}