{"lesson": {"type": "sentence", "title": "Newsies Strike New York", "sentence": "Today, people can buy a newspaper from a machine or at a newsstand. But back in the 1800s, newsboys, or “newsies,” were the principal sellers of newspapers. Newsies sold their newspapers, or “papes,” on New York’s streets. Newsies bought their newspapers from the companies that printed them. The newsboys then made their money by selling the newspapers to customers. For two weeks in 1899, however, the newsies went on strike, refusing to sell papers. Boys from 5 to 15 years old united to make two newspaper companies reduce the price that they charged newsies for the newspapers. Striking newsboys held rallies, gave speeches, and chose leaders. One rally drew more than 7,000 striking newsies. Newsboys who continued to sell papers were harassed by the strikers. Some strikers threw the newspapers away, and others threatened to hurt the newsboys who wouldn’t stop selling newspapers. What started the strike? During the Spanish-American War, people were eager to read the news, so the Journal and Evening World raised the price that they charged for their newspapers. Newsies had to pay ten cents more for the papers. A dime made a difference to the kids who earned less than a dollar each day. Most newsies lived on the streets. Others used their earnings to help their struggling families. When the war ended, newsies expected newspaper companies to reduce their prices, but that did not happen. Although the cost of papers to newsies never dropped, the strike was considered a success. The two offending newspaper companies agreed to buy back all unsold papers, and eventually this strike helped bring about child labor laws in the United States.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "Where and when did the strike occur?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "In a spanish-american colony in the 1800s", "value": "In a spanish-american colony in the 1800s"}, {"text_en": "In new york city in the 1950s and 60s", "value": "In new york city in the 1950s and 60s"}, {"text_en": "In new york city in 1899", "value": "In new york city in 1899"}, {"text_en": "In spain in the 1890s", "value": "In spain in the 1890s"}]}, {"type": "scq", "sentence": "How do you think the strike helped bring about labor laws?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "The public became aware of the newsboys problems.", "value": "The public became aware of the newsboys problems."}, {"text_en": "The newspaper companies decided to help all newsboys.", "value": "The newspaper companies decided to help all newsboys."}, {"text_en": "People decided to buy their newspapers from machines and newsstands.", "value": "People decided to buy their newspapers from machines and newsstands."}, {"text_en": "Newspaper companies stopped selling their newspapers to the public.", "value": "Newspaper companies stopped selling their newspapers to the public."}]}, {"type": "scq", "sentence": "What lesson can you learn from the passage?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Working together gets things done.", "value": "Working together gets things done."}, {"text_en": "People should not read about war.", "value": "People should not read about war."}, {"text_en": "Holding rallies is not a good strategy for changing things.", "value": "Holding rallies is not a good strategy for changing things."}, {"text_en": "Businesses that treat workers badly do not succeed.", "value": "Businesses that treat workers badly do not succeed."}]}, {"type": "scq", "sentence": "Based on the passage, which characteristics were most common in a newsboy?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Kind, sweet-tempered, and gentle", "value": "Kind, sweet-tempered, and gentle"}, {"text_en": "Cruel, defiant, and undependable", "value": "Cruel, defiant, and undependable"}, {"text_en": "Smart, quiet, and considerate", "value": "Smart, quiet, and considerate"}, {"text_en": "Self-reliant, hardworking, and loyal", "value": "Self-reliant, hardworking, and loyal"}]}]}