{"lesson": {"type": "sentence", "title": "Forests Of Clouds And Mist", "sentence": "You’ve probably heard of rainforests, but do you know what a cloud forest is? Cloud forests are evergreen forests that are often covered in clouds or mist and are located on mountains. Cool temperatures on mountain slopes create clouds that cover the trees. There are cloud forests on most continents. Central and South America have them, as do Asia and Africa. You can also find cloud forests in Hawaii and on Caribbean islands. Cloud forests have different names, depending on where they are found. Cloud forests are also known as fog forests or mossy forests. In Peru and Bolivia, cloud forests are part of a larger ecosystem called yungas, which means “warm lands.” Many scientists consider cloud forests to be a special type of rainforest. Cloud forests are not as warm as tropical rainforests because they are found at higher elevations that have colder air. But cloud forests and tropical rainforests both have many different plants and animals living within their ecosystems. Like tropical rainforests, cloud forest trees drip with moisture, but it does not often rain in a cloud forest. Instead, the fog collects as dew on leaves, vines, and branches. This dew provides the water that the plants need. Green moss, ferns, and exotic, colorful orchid flowers hang down from the canopy. Other plants and bushes crowd between the trees, and hundreds of insects crawl and fly amid the vegetation. Cloud forests are as diverse and interesting as rainforests or temperate forests. Cloud forests have animals that aren’t found anywhere else, such as mountain gorillas and a strange woolly mammal called the mountain tapir. The colorful quetzal bird is also found there, and golden toads hop among the bushes. Recently, scientists discovered a new cloud forest animal, a black and brown rodent that looks like a cross between a squirrel and a rat. Cloud forests probably contain hundreds of other rare and fascinating plants and animals that people have never seen before.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "What is the passage mostly about?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "The animals of the cloud forest", "value": "The animals of the cloud forest"}, {"text_en": "What the cloud forest is like", "value": "What the cloud forest is like"}, {"text_en": "Where cloud forests are found", "value": "Where cloud forests are found"}, {"text_en": "How scientists study the cloud forest", "value": "How scientists study the cloud forest"}]}, {"type": "scq", "sentence": "Clouds form in the cloud forest because .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Temperatures are cool", "value": "Temperatures are cool"}, {"text_en": "There are so many trees", "value": "There are so many trees"}, {"text_en": "The forests are so low", "value": "The forests are so low"}, {"text_en": "It is so moist there", "value": "It is so moist there"}]}, {"type": "scq", "sentence": "The passage includes details about .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Why scientists study cloud forests", "value": "Why scientists study cloud forests"}, {"text_en": "The kinds of trees in cloud forests", "value": "The kinds of trees in cloud forests"}, {"text_en": "The animals and plants of cloud forests", "value": "The animals and plants of cloud forests"}, {"text_en": "Why cloud forests are endangered", "value": "Why cloud forests are endangered"}]}, {"type": "scq", "sentence": "How are cloud forests and tropical rainforests different?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Cloud forests have more plants.", "value": "Cloud forests have more plants."}, {"text_en": "Cloud forests are wetter.", "value": "Cloud forests are wetter."}, {"text_en": "Cloud forests are studied by scientists.", "value": "Cloud forests are studied by scientists."}, {"text_en": "Cloud forests are found on mountain slopes.", "value": "Cloud forests are found on mountain slopes."}]}]}