{"lesson": {"type": "sentence", "title": "Kids Take To The Airwaves", "sentence": "On the first Sunday in March each year, kids get to take over the world’s airwaves. The United Nations Children’s Fund (UNICEF) has designated that day as the International Children’s Day of Broadcasting, or ICDB. Television and radio stations around the world invite young people to be part of their programming. Thousands of broadcasters and kids participate, and the programs focus on children’s interests and issues. Kids are also involved in the broadcast process, learning how radio and television programs are made. ICDB gives children a voice that can be heard around the world. On ICDB in 2009, young people all over the globe reported on issues that affected them. Nearly 100 children from India recorded stories about a flood in their area. Children in China drew pictures with messages for their parents. In Senegal, young people spoke out against violence by giving reports, conducting interviews, writing poems, and singing songs. German children talked with young people in Serbia and shared drawings and photographs. Australian kids voiced their opinions to children in Cambodia, Fiji, and Tonga. Kids produced videos on a variety of different topics, from air pollution to loneliness. Across the world, young people expressed their feelings and sent messages about what mattered most to them. After ICDB is over, UNICEF holds a contest for the best radio or television program. People who make the programs that air during ICDB can send submit their programs. The winners attend a special celebration. The 2009 radio winner was a station in Brazil that broadcasted a show for 24 hours about children from poor communities. The show used interviews, diaries, and music to promote peace. The winner for the television program was a station in Kenya. The show, which was hosted by two Kenyan youths, talked about the challenges that Kenyan children face and highlighted positive stories about young people in their communities.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "What is the first paragraph mostly about?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "What unicef is", "value": "What unicef is"}, {"text_en": "Young people on television", "value": "Young people on television"}, {"text_en": "The icdb", "value": "The icdb"}, {"text_en": "Children communicating", "value": "Children communicating"}]}, {"type": "scq", "sentence": "What is the second paragraph mostly about?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Programs that unicef offers", "value": "Programs that unicef offers"}, {"text_en": "Australian children", "value": "Australian children"}, {"text_en": "The icdb in 2009", "value": "The icdb in 2009"}, {"text_en": "Malaysian videos", "value": "Malaysian videos"}]}, {"type": "scq", "sentence": "What do tv and radio stations both do on icdb?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Invite children to be part of programming", "value": "Invite children to be part of programming"}, {"text_en": "Ask young people to talk to their parents", "value": "Ask young people to talk to their parents"}, {"text_en": "Raise money for unicef", "value": "Raise money for unicef"}, {"text_en": "Encourage children to join unicef", "value": "Encourage children to join unicef"}]}, {"type": "scq", "sentence": "The purpose of the icdb is to .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Raise money for children", "value": "Raise money for children"}, {"text_en": "Give young people a voice", "value": "Give young people a voice"}, {"text_en": "Help kids get jobs in broadcasting", "value": "Help kids get jobs in broadcasting"}, {"text_en": "Give awards for broadcasting", "value": "Give awards for broadcasting"}]}]}