{"lesson": {"type": "sentence", "title": "A Plane In The Hudson River", "sentence": "Some airplanes are made specifically to land on water, but US Airways Flight 1549 was not one of those planes. The plane took off from LaGuardia Airport on January 15, 2009, with 155 people on board. Just three minutes later, the pilot, Captain Chesley Sullenberger, radioed that the plane was in trouble. It had hit some large geese. The left engine had exploded in fire, smoke, and metal. Captain Sullenberger quickly realized that the plane could not make it back to the airport. The aircraft was rapidly losing power and would soon be too slow to stay in the air. Sullenberger turned the plane toward the Hudson River, which flows between New York and New Jersey. “Brace for impact!” Captain Sullenberger announced over the intercom. Many passengers were tense and scared, but the flight crew did their best to keep everyone calm. Most passengers lowered their heads and got ready for a rough crash landing. After several tension-filled minutes, Captain Sullenberger landed the plane perfectly on the surface of the Hudson River. People watching from ferries that were traveling between New York and New Jersey were shocked at the sight. The plane’s passengers climbed onto the wings as the plane began to fill with water and sink. Boats from both sides of the river rushed to aid the stranded passengers. The waters were icy cold, and the smell of gasoline filled the air. As passengers scrambled from the plane to the waiting boats, rescuers handed them blankets, coats, and life jackets to stay warm. All 155 people were brought to safety, and Captain Sullenberger was celebrated as a hero. It was the first time a major aircraft had ever crash-landed in water with no deaths.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "What is the passage mostly about?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "The reasons planes crash", "value": "The reasons planes crash"}, {"text_en": "The courage of captain sullenberger", "value": "The courage of captain sullenberger"}, {"text_en": "The emergency landing of flight 1549", "value": "The emergency landing of flight 1549"}, {"text_en": "The dangers of flying", "value": "The dangers of flying"}]}, {"type": "scq", "sentence": "The planes engines quit working because the plane .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Filled with water", "value": "Filled with water"}, {"text_en": "Had hit birds", "value": "Had hit birds"}, {"text_en": "Began to sink", "value": "Began to sink"}, {"text_en": "Carried too many people", "value": "Carried too many people"}]}, {"type": "scq", "sentence": "How did this landing differ from other emergency water landings?", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "This plane was designed to land on water.", "value": "This plane was designed to land on water."}, {"text_en": "This plane did not sink.", "value": "This plane did not sink."}, {"text_en": "The engines continued to run.", "value": "The engines continued to run."}, {"text_en": "Everyone survived the crash.", "value": "Everyone survived the crash."}]}, {"type": "scq", "sentence": "People in new york and new jersey were shocked because .", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "They saw large birds in the air", "value": "They saw large birds in the air"}, {"text_en": "Boats came to rescue the passengers", "value": "Boats came to rescue the passengers"}, {"text_en": "There was an airplane in the river", "value": "There was an airplane in the river"}, {"text_en": "Captain sullenberger stayed on the plane", "value": "Captain sullenberger stayed on the plane"}]}]}