{"lesson": {"type": "sentence", "title": "How Hot Is That Pepper?", "sentence": "If you love hot, spicy foods, you probably love hot peppers! The spiciness in peppers is determined by special chemicals. If a pepper has a lot of these chemicals, it will be hot. The heat in peppers is measured using the Scoville scale, which is named after the man who invented it, Wilbur Scoville. Bell peppers are at the bottom of the scale because they don’t have much of the chemical that makes peppers hot. Pepperoncini (pep-ur-ohn-CHEE-nee), which usually are pickled, are somewhat hotter than bell peppers. Spicier still are Anaheim and poblano peppers, which are good for mild sauces or for roasting and stuffing with cheese. Then there’s the famous jalapeño pepper, found in spicy dishes worldwide. With a Scoville heat unit (SHU) rating of 2,500 to 8,000, this little green pepper makes salsas sing with #avor. Many peppers are hotter than the jalapeño, but not many mouths can tolerate peppers that have the highest Scoville ratings. Some yellow Hungarian wax peppers are nearly twice as hot as a jalapeño. Cayenne pepper, often sold in powder form, can be 10 times as hot. But even these peppers pale in comparison to the ghost chili pepper. The ghost chili pepper, which comes from India, currently holds the record as the hottest pepper in the world, with a Scoville rating of over one million. Some farmers in Africa grow these peppers around their crops to keep wild elephants out of their \"elds. Now that’s a powerful pepper!", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "Which statement from the passage is an opinion", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Anaheim peppers can be roasted and stuffed", "value": "Anaheim peppers can be roasted and stuffed"}, {"text_en": "Not many mouths can tolerate the hottest peppers", "value": "Not many mouths can tolerate the hottest peppers"}, {"text_en": "Poblano peppers are spicier than pepperoncini", "value": "Poblano peppers are spicier than pepperoncini"}, {"text_en": "Bell peppers are lowest on the scoville scale.", "value": "Bell peppers are lowest on the scoville scale."}]}, {"type": "scq", "sentence": "Which statement is an opinion about the ghost chili pepper", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "It is the hottest pepper in the world", "value": "It is the hottest pepper in the world"}, {"text_en": "It has a scoville rating of over one million", "value": "It has a scoville rating of over one million"}, {"text_en": "It is grown in india", "value": "It is grown in india"}, {"text_en": "Other peppers pale in comparison to it.", "value": "Other peppers pale in comparison to it."}]}, {"type": "scq", "sentence": "Based on the passage, which statement is an opinion", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Fans of spicy foods will love hot peppers", "value": "Fans of spicy foods will love hot peppers"}, {"text_en": "The hungarian wax pepper is yellow", "value": "The hungarian wax pepper is yellow"}, {"text_en": "Jalapeo peppers are used worldwide", "value": "Jalapeo peppers are used worldwide"}, {"text_en": "Special chemicals determine the level of spiciness in peppers.", "value": "Special chemicals determine the level of spiciness in peppers."}]}, {"type": "scq", "sentence": "Which statement is a fact about the scoville scale", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "The best peppers have the highest shu", "value": "The best peppers have the highest shu"}, {"text_en": "It measures the length of peppers", "value": "It measures the length of peppers"}, {"text_en": "Ratings are expressed in shus", "value": "Ratings are expressed in shus"}, {"text_en": "It was named after a pepper farmer", "value": "It was named after a pepper farmer"}]}]}