{"lesson": {"type": "sentence", "title": "Oil From A Stone", "sentence": "It may seem impossible to remove oil from a stone, but that hasn’t stopped people from trying. Scientists argue that with new technology and creative thinking, getting oil from a stone may not be as difficult as we think. Of course, it also takes the right kind of rocks. Shale oil is oil that exists in solid form within rock. This unique oil was formed from fossilized creatures from the Tertiary (TUR-shee-air-ee) period, about 65 million years ago, and high levels of heat and pressure. Mining shale oil is much more difficult than removing liquid oil. Workers must take extra care to protect the surrounding area during this difficult procedure. Otherwise, the process can cause erosion and can pollute the groundwater. In addition, shale oil must be heated to extreme temperatures and must be re\"ned even further after it has been pulled from the ground. The re\"ning process, like the mining process, takes a lot of water. This is another serious concern. Although it is hard to collect, shale oil has long-term potential. There is enough shale oil in the western United States to meet current oil demands for about 400 years. Some people say that with enough funding for research, shale oil could be collected easily one day.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "What is the purpose of the last paragraph", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "To emphasize that extra care must be taken in collecting shale oil", "value": "To emphasize that extra care must be taken in collecting shale oil"}, {"text_en": "To persuade readers to use less oil", "value": "To persuade readers to use less oil"}, {"text_en": "To argue that shale oil is too difficult to collect", "value": "To argue that shale oil is too difficult to collect"}, {"text_en": "To convince readers that research is worthwhile", "value": "To convince readers that research is worthwhile"}]}, {"type": "scq", "sentence": "How are shale oil and liquid oil different", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Shale oil is more difficult to mine", "value": "Shale oil is more difficult to mine"}, {"text_en": "Mining liquid oil causes more erosion", "value": "Mining liquid oil causes more erosion"}, {"text_en": "Liquid oil requires more refining", "value": "Liquid oil requires more refining"}, {"text_en": "Shale oil is easier to cool.", "value": "Shale oil is easier to cool."}]}, {"type": "scq", "sentence": "How are shale oil and liquid oil alike", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "High temperatures are needed to extract them", "value": "High temperatures are needed to extract them"}, {"text_en": "Neither is found in the united states", "value": "Neither is found in the united states"}, {"text_en": "More research is needed to collect them easily", "value": "More research is needed to collect them easily"}, {"text_en": "Both are found in the ground.", "value": "Both are found in the ground."}]}, {"type": "scq", "sentence": "Which quote best shows concern for the environment", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Shale oil must be heated to extreme temperatures ", "value": "Shale oil must be heated to extreme temperatures "}, {"text_en": "", "value": ""}, {"text_en": "Workers must take extra care to protect the surrounding area ", "value": "Workers must take extra care to protect the surrounding area "}, {"text_en": "", "value": ""}]}]}