{"lesson": {"type": "sentence", "title": "The Egg Drop", "sentence": "Marisol, Jack, and Ramon met after school to work on their group science project. Their assignment was to \"nd a way to protect an egg from breaking as it was dropped from a two-story building. Marisol and Ramon were busy working with their materials, which included a pile of newspapers, some bubble wrap, and rubber bands. Marisol was tearing newspaper into strips and watching Jack doodle in a notebook. Finally, she couldn’t stay quiet any longer. “Jack, when are you going to help us?” she asked. “We need to get this project done today.” Ramon reached across the table for another rubber band to weave into the rubber mat he was trying to make. “Yeah, Jack,” he said. “Could you put down your cartoons and help us?” Jack was a good friend, but he didn’t seem to give science class the same attention that Ramon and Marisol did. His mind always seemed to be somewhere else—mainly in his notebook. Jack looked up so slowly that Marisol and Ramon thought he may not have heard them at all. Then he turned the page toward them. Jack had sketched a diagram that showed an egg in the center of a layer of newspaper and bubble wrap. The egg had been wrapped with several rubber bands, which crisscrossed each other to make a thick layer of padding. Marisol and Ramon were impressed. “I was just brainstorming,” Jack said. “Do you think it’ll work?”", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "What do the three students have in common", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "They like to draw cartoons", "value": "They like to draw cartoons"}, {"text_en": "They are working on the same project", "value": "They are working on the same project"}, {"text_en": "They are easily distracted", "value": "They are easily distracted"}, {"text_en": "They do not want to use rubber bands.", "value": "They do not want to use rubber bands."}]}, {"type": "scq", "sentence": "How is jacks way of working on the project different from that of his partners", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "He does not work as hard as they do", "value": "He does not work as hard as they do"}, {"text_en": "He sketches his ideas first", "value": "He sketches his ideas first"}, {"text_en": "He does not care if the egg breaks", "value": "He does not care if the egg breaks"}, {"text_en": "He wants to spend more time on it.", "value": "He wants to spend more time on it."}]}, {"type": "scq", "sentence": "How is jacks plan different from ramons", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "It uses different materials", "value": "It uses different materials"}, {"text_en": "It will be more difficult to do", "value": "It will be more difficult to do"}, {"text_en": "It will keep the egg from breaking", "value": "It will keep the egg from breaking"}, {"text_en": "It uses rubber bands in a different way.", "value": "It uses rubber bands in a different way."}]}, {"type": "scq", "sentence": "What do marisol and ramon probably think at the end of the story", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "They decide their ideas are not very good", "value": "They decide their ideas are not very good"}, {"text_en": "They think they need a sketch to succeed", "value": "They think they need a sketch to succeed"}, {"text_en": "They agree they do not need jacks help", "value": "They agree they do not need jacks help"}, {"text_en": "They realize jack was working the whole time.", "value": "They realize jack was working the whole time."}]}]}