{"lesson": {"type": "sentence", "title": "Rare And Beautiful Blooms", "sentence": "One of the rarest fowering plants in the world, the Snowdonia hawkweed, grows wild only in Snowdonia National Park in northern Wales. The region is rocky and mountainous, and the air is cool and damp. The Snowdonia hawkweed prefers this habitat. In fact, it grows nowhere else in the world. It is even picky about where it grows in the park. Snowdonia hawkweed is about 11 inches tall. Its bright yellow blossoms have thin petals with ragged edges. The Snowdonia hawkweed may not be the most beautiful plant in the world, but it is a favorite snack of sheep. In 1953, the Snowdonia hawkweed disappeared. People feared that the plant was gone forever. They believed that sheep grazing on the land had eaten the last few plants. So, the people who ran the park removed the sheep from the area, hoping that the hawkweed might return. Forty-nine years later, a group of plant scientists found the yellow #owers blooming in one spot in the park. The hawkweed had returned! Scientists collected seeds from the plant in case it disappeared again. But since 2002, the rare plant has continued to bloom in the park.", "key_words": [{"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}, {"word": "word", "translation": "--", "speech": "名词", "example": "N/A"}]}, "test": [{"type": "scq", "sentence": "Which phrase best describes the climate of snowdonia national park", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Cold and snowy", "value": "Cold and snowy"}, {"text_en": "Hot and dry", "value": "Hot and dry"}, {"text_en": "Cool and damp", "value": "Cool and damp"}, {"text_en": "Warm and windy", "value": "Warm and windy"}]}, {"type": "scq", "sentence": "Which group of people would probably care most if snowdonia hawkweed disappeared", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Scientists who study plants", "value": "Scientists who study plants"}, {"text_en": "Farmers who graze their sheep in the mountains", "value": "Farmers who graze their sheep in the mountains"}, {"text_en": "Scientists who study rare birds and insects", "value": "Scientists who study rare birds and insects"}, {"text_en": "Visitors who enjoy hiking in the mountains", "value": "Visitors who enjoy hiking in the mountains"}]}, {"type": "scq", "sentence": "From the passage, you can conclude that snowdonia hawkweed ", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Is the most beautiful plant in the world", "value": "Is the most beautiful plant in the world"}, {"text_en": "Grows like a weed in northern wales", "value": "Grows like a weed in northern wales"}, {"text_en": "Was always rare", "value": "Was always rare"}, {"text_en": "Will never be seen again in the wild", "value": "Will never be seen again in the wild"}]}, {"type": "scq", "sentence": "Which adjective best describes how people felt when snowdonia hawkweed was found in 2002", "hint": "N/A", "answer": ["-----"], "card_data": [{"text_en": "Curious", "value": "Curious"}, {"text_en": "Disappointed", "value": "Disappointed"}, {"text_en": "Concerned", "value": "Concerned"}, {"text_en": "Thrilled", "value": "Thrilled"}]}]}